ХМНПФ_Общее/Documents/уп_ВозвратПрочихНачисленийОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратПрочихНачисленийОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Решение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийВозвратПрочихНачисленийОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НеПрекращатьВыплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ВозвратВИЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыВыплат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыРасторженцам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплатаОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПенсийОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратМатеринскогоКапитала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрочнаяПенсияОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатПравопреемникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратЕдиновременнойВыплатыОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНакопительнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратСрочнойПенсииОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратПенсииНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатНаследникамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратВыплатРасторженцамНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереводВДругойНПФ_НПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыНаследникамОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПенсияНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежРасторжениеНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиНПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежНПОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежСВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежЕВОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтвергнутыйПлатежПравопреемникиОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ВозвратПрочихНачисленийОПС/Forms/уф_ФормаДокумента/Ext/Form/Module.bsl
#Область ХМНПФ


Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 29.02.2016 ШадринАВ // новый флаг на форме "Не прекращать выплаты" // №244
	// ХМНПФ+ 20.02.2016 ШадринАВ // новое поле на форме ХМ_ВозвратСПлатежногоПоручения // №278
	// ХМНПФ+ 28.03.2016 ШадринАВ // новое поле Участник на форме  // №276
	// ХМНПФ+ 17.10.2017 ШадринАВ // новый флаг на форме "Возврат переплаты" // №1995
	// ХМНПФ+ 11.04.2018 КлименкоМИ // новый флаг на форме "Возврат в ИЛС" // №1510
	// ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510	
	// ХМНПФ 27.12.2018 ГригорьевМА // новый ХМ_ПриСозданииНаСервере() // №1967
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// ХМНПФ 11.04.2018 КлименкоМИ // новый ХМ_ПриСозданииНаСервере() // №1510
	ХМ_РаботаСФормами.уп_ВозвратПрочихНачисленийОПСПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+ХМНПФ 28.03.2016 ШадринАВ // ХМ_ПриСозданииНаСервере()  // №276
	Элементы.ДоговорОПС.КнопкаОткрытия = Истина;
	//-ХМНПФ 28.03.2016 ШадринАВ // ХМ_ПриСозданииНаСервере()  // №276
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ХМ_ВозвратВИЛС = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимость")
Процедура ХМУстановитьВидимость()
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Элементы.Правопреемник.Видимость = Истина;
	Иначе
		Элементы.Правопреемник.Видимость = Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений
		или Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвращенныйПлатежВРезерв
		или Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ОтвергнутыйПлатежВРезерв Тогда
		Элементы.ПредставлениеОснования.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеОснования.Видимость = Истина;
	КонецЕсли;	
	//Элементы.Группа2.Видимость=Объект.ОтражатьВБухгалтерскомУчете;
	#Вставка
	// +ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510	
	Если Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений
		И  Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Элементы.ХМ_ВозвратВИЛС.Видимость = Истина;
	Иначе
		Элементы.ХМ_ВозвратВИЛС.Видимость = Ложь;
	КонецЕсли;
	// -ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510
	#КонецВставки
КонецПроцедуры

#КонецОбласти
